depper-IA/ESPetral-Rescue/firmware/sdkconfig.defaults
# CALI CSI Node - Default SDK Configuration
# Target: ESP32-C6

CONFIG_IDF_TARGET="esp32c6"

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# NVS
CONFIG_NVS_ENCRYPTION=n

# Wi-Fi
CONFIG_ESP_WIFI_MODE_STA=y
CONFIG_ESP_WIFI_CSI_ENABLED=y

# MQTT
CONFIG_MQTT_PROTOCOL_5=n

# Power management
CONFIG_PM_ENABLE=y
CONFIG_PM_LIGHT_SLEEP_CALLBACKS=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
